Repository: 84000/data-translation-memory
Catalog: toh266-v3.tmx
Source language: bo
Languages: en

source: །འདི་དག་འགོག་པར་བྱེད་པ་ནི།
en: Those who create obstacles for them

source: །མངོན་པར་བརྩོན་པའི་འབྲས་བུ་མེད།
en: Will not collect the fruits of their efforts.

source: །སངས་རྒྱས་མཚན་ནི་ལེགས་བཤད་པ།
en: “Upon hearing the names of the buddhas,

source: །དེ་ལྟ་བུ་ཡི་མཚན་ཐོས་ནས།
en: Which are eloquently spoken,

source: །སངས་རྒྱས་དག་གི་བསྔགས་པ་སྨྲ།
en: They will extol praises for the buddhas,

source: །ཕྱོགས་བཅུ་དག་ན་འཇིག་རྟེན་མགོན།
en: As protectors of the world, throughout the ten directions.

source: །རྫོགས་པའི་སངས་རྒྱས་མཚན་བསྟོད་དེ།
en: “Those who praise the names of the perfect buddhas, Recollecting the buddhas’ names

source: །ཡང་དང་ཡང་དུ་སངས་རྒྱས་ཀྱི། །མཚན་རྣམས་མི་གང་དྲན་བྱེད་པ།
en: Again and again,

source: །དེ་ནི་མྱུར་དུ་དྲི་མེད་འགྱུར།
en: Will swiftly become immaculate.

source: །སྲོག་ཆགས་རྣམས་ཀྱིས་བཀུར་བ་ཡིན།
en: “Venerated by living beings, They will teach the buddhas’ awakening

source: །ཆགས་པ་མེད་པའི་སྤོབས་པ་ཡིས། །སངས་རྒྱས་བྱང་ཆུབ་རབ་ཏུ་སྟོན།
en: With unimpeded eloquence.

source: །འོད་སྲུང་སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཟླ་བའི་བླ་མ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Kāśyapa, above there is a world system called Guru of the Moon.

source: །དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་སྣང་བས་རྣམ་པར་གནོན་པ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: There dwells the thus-gone one, the worthy one, the completely perfect buddha called Overwhelming with Golden Light.

source: །འོད་སྲུང་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་རྩོད་པ་ལ་དགའ་བ་མདོག་ངན་བརྩེགས་པ་ཞེས་བྱ་བ་དེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མ་ཕམ་པའི་དཔལ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Kāśyapa, above this buddhafield, in the world system called Pile of Bad Colors That Delights in Disputation, dwells the thus-gone one, the worthy one, the completely perfect buddha called Glory of Invincibility.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་སློབ་དཔོན་དང་ལྡན་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཚད་མེད་པའི་བླ་མ་བདེ་བར་གཤེགས་པ་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Above, in the world system called Endowed with Teachers, dwells the thus-gone one, the worthy one, the completely perfect buddha called Thus-Gone King, Guru of Immeasurably Many.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་རི་རབ་རྒྱལ་མཚན་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མ་རླན་པའི་གླང་པོ་དམ་པ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Above, in the world system called Victory Banner of Mount Sumeru, dwells the thus-gone one, the worthy one, the completely perfect buddha called Sublime Elephant Out of Rut.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཤིན་ཏུ་མཛེས་པ་རྟོག་པའི་བྱང་ཆུབ་ཅེས་བྱ་བ་དེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བརྩོན་འགྲུས་གྲངས་མེད་པ་ལ་ཞུགས་པའི་དཔལ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Above, in the world system called Awakening of Beautiful Thought, dwells the thus-gone one, the worthy one, the completely perfect buddha called Glory of Being Immersed in Incalculable Effort.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་འཛིན་པ་མེད་པ་དེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དགོངས་པ་བརྗོད་ཀྱིས་མི་ལང་བ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Above, in the world system called Non-grasping, dwells the thus-gone one, the worthy one, the completely perfect buddha called Inexpressible Intention.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཚངས་པར་སྤྱོད་པས་བརྒྱན་པ་ཞེས་བྱ་བ་དེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གཏི་མུག་མེད་པའི་སྤོས་དཔལ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Above, in the world system called Ornamented by Pure Conduct, dwells the thus-gone one, the worthy one, the completely perfect buddha called Glory of the Incense of Non-ignorance.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཉི་མ་སྣང་བ་ཞེས་བྱ་བ་དེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བ་དཔལ་ཞེས་བྱ་བ་བཞུགས་སོ། །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཆོས་མཆོག་ཅེས་བྱ་བ་དེ་ན།
en: “Above, in the world system called Light of the Sun, dwells the thus-gone one, the worthy one, the completely perfect buddha called Glory of the Moon.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་མི་རྟོག་པའི་འོད་ཅེས་བྱ་བ་བཞུགས་སོ། །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཆོས་སྤྱོད་ཅེས་བྱ་བ་དེ་ན།
en: “Above, in the world system called Supreme Dharma, dwells the thus-gone one, the worthy one, the completely perfect buddha called Light of Non-conceptuality.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནམ་མཁའ་སྣང་བ་ཞེས་བྱ་བ་བཞུགས་སོ། །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་དགེ་བ་སོགས་པ་ཞེས་བྱ་བ་དེ་ན།
en: “Above, in the world system called Religious Practice, dwells the thus-gone one, the worthy one, the completely perfect buddha called Light of the Sky.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤྱོད་པ་ཡོངས་སུ་དག་པའི་ཏོག་ཅེས་བྱ་བ་བཞུགས་སོ། །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བ་དེ་ན།
en: “Above, in the world system called Mass of Virtue, dwells the thus-gone one, the worthy one, the completely perfect buddha called Peak of Pure Conduct.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གཏེར་ལེགས་པར་གནས་པ་ཞི་བ་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Above, in the world system called Victorious, dwells the thus-gone one, the worthy one, the completely perfect buddha called King of the Well-Settled Treasury of Peace.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་བརྩོན་འགྲུས་སྐྱེས་པ་ཞེས་བྱ་བ་དེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དོན་ཐམས་ཅད་གྲུབ་པ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Above, in the world system called Source of Diligence, dwells the thus-gone one, the worthy one, the completely perfect buddha called Accomplisher of All Goals.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་སྨོན་ལམ་གྱི་སྟོབས་ཞེས་བྱ་བ་དེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤེས་རབ་ཀྱིས་སྦེད་པའི་དཔལ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Above, in the world system called Power of Aspiration, dwells the thus-gone one, the worthy one, the completely perfect buddha called Glory of the Protection by Knowledge.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་མདངས་དགའ་བའི་ཕྱོགས་ཞེས་བྱ་བ་དེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གཏམ་ཤིན་ཏུ་ཡོངས་སུ་དག་པར་མཛད་པ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Above, in the world system called Region of Joyous Radiance, dwells the thus-gone one, the worthy one, the completely perfect buddha called Complete Purifier of Speech.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཙན་དན་གྱི་དྲིའི་ཕུག་ཅེས་བྱ་བ་དེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཻ་དཱུརྱའི་སྙིང་པོ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Above, in the world system called Cave of Sandalwood Fragrance, dwells the thus-gone one, the worthy one, the completely perfect buddha called Essence of Vaiḍūrya.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་དང་ལྡན་པ་ཞེས་བྱ་བ་དེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་ཡོན་ཏན་རིན་པོ་ཆེས་རྣམ་པར་གནོན་པ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Above, in the world system called Endowed with Jewels, dwells the thus-gone one, the worthy one, the completely perfect buddha called Overwhelming All with Precious Qualities.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་ཚད་མེད་དཔལ་ཞེས་བྱ་བ་དེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་ཏན་ཤིན་ཏུ་ཡོངས་སུ་དག་པ་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Above, in the world system called Glory of Immeasurable Qualities, dwells the thus-gone one, the worthy one, the completely perfect buddha called Well Established in Perfectly Pure Qualities.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཉན་ཐོས་མ་འོངས་པ་ཞེས་བྱ་བ་དེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་སྣང་བས་རྣམ་པར་གནོན་པའི་མཆོད་རྟེན་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Above, in the world system called Future Hearers, dwells the thus-gone one, the worthy one, the completely perfect buddha called Stūpa That Overwhelms with Jewel Light.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་གཉིད་མེད་པའི་མིག་ཅེས་བྱ་བ་དེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཚད་མེད་པའི་ཁྲེལ་ཡོད་པ་གསེར་དམ་པའི་དཔལ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Above, in the world system called Sleepless Eye, dwells the thus-gone one, the worthy one, the completely perfect buddha called Glory of the Finest Gold of Immeasurable Propriety.”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ།
en: The Blessed One then spoke the following verses:

source: །སངས་རྒྱས་དཔལ་གྱི་ཟླ་བ་ཅན།
en: “The buddha Endowed with the Moon of Glory

source: །རྒྱལ་ཆེན་མི་ཡི་ཁྱུ་མཆོག་སྟེ།
en: Is a great king, supreme among humans,

source: །སངས་རྒྱས་ཁྱུ་མཆོག་དེ་དག་ནི།
en: And the buddhas, supreme among humans,

source: །ཆོས་ཀུན་རྣམ་པར་སྤྱོད་པ་མཛད།
en: Range over all phenomena.

source: །སངས་རྒྱས་དེ་དག་མིང་རྣམས་ཀྱིས།
en: “The buddhas, by means of their names,

source: །སངས་རྒྱས་ཞིང་ནི་རྣམ་པར་སྤྱོད།
en: Range across the buddhafields.

source: །མི་གང་དེ་ཡི་མཚན་རྣམས་ནི།
en: People who hear their names

source: །བསྐལ་པ་འདིར་ནི་ཉན་འགྱུར་ཞིང་།
en: In this eon,

source: །གང་དག་དད་པར་འགྱུར་བ་དང་། །དེ་ལ་རི་མོར་བཅས་པ་དག །དེ་དག་དཔའ་བོ་ཤེས་རབ་ཆེ།
en: “And become filled with faith And reverential toward them Will be heroes with great insight.

source: །དེ་དག་སངས་རྒྱས་དམ་པར་འགྱུར།
en: They will become sublime buddhas.

source: །དེ་དག་ཡེ་ཤེས་མཐའ་ཡས་ཏེ།
en: “Their wisdom will be infinite;

source: །དེ་ལ་ནེམ་ནུར་མ་བྱེད་ཅིག །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཤིན་ཏུ་མཛེས་པའི་པད་མ་ཞེས་བྱ་བ་དེ་ན།
en: Have no doubt about it!

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པ་རྣམ་པར་འཕྲུལ་པའི་དཔལ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Above, in the world system called Beautiful Lotus, dwells the thus-gone one, the worthy one, the completely perfect buddha called Glory of the Manifestation of the Sublime Lotus.

source: དེའི་མཚན་ཐོས་ན་ངན་སོང་གསུམ་ཡང་བཅད་པར་འགྱུར། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་མེ་ཏོག་ཀྱང་ལེགས་པར་རྒྱས་པར་འགྱུར་རོ།
en: Those who hear his name will be cut off from the three lower realms.

source: །དེ་དག་བསྐལ་པ་སུམ་ཅུ་རྩ་དྲུག་ཏུ་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: In thirty-six eons, they will turn away from saṃsāra.”

source: །འཇིག་རྟེན་ཁམས་ནི་ལེགས་བརྒྱན་པ།
en: “In the finely-adorned world system

source: །པད་མོ་ཤིན་ཏུ་མཛེས་ཞེས་བྱ།
en: Called Beautiful Lotus,

source: །ལྷ་ཡི་དགའ་བའི་ཚལ་བཞིན་དུ། །རྟག་པར་ཤིན་ཏུ་བརྒྱན་པ་སྟེ།
en: Which is permanently and exquisitely adorned Like a divine grove,

source: །པད་མ་བླ་དཔལ་མཁས་པ་སྟེ།
en: Skillful in the Glory of the Lotus Guru.

source: །སངས་རྒྱས་ཞིང་དེར་རྣམ་པར་འཕྲུལ།
en: In that buddhafield he performs miracles

source: །སྲོག་ཆགས་རྣམས་ལ་ཆོས་ཀྱང་སྟོན།
en: And teaches the Dharma to living beings.

source: །སྐྱེས་པ་དང་ནི་བུད་མེད་ཀྱིས།
en: “Once men and women

source: །དེ་ཡི་མཚན་ཀྱང་ཐོས་ནས་ནི།
en: Have heard his name,

source: །ངན་སོང་གསུམ་ནི་རྣམ་སྤོང་ཞིང་།
en: They will avoid the three lower realms

source: །སངས་རྒྱས་དག་ཀྱང་མང་པོ་མཐོང་།
en: And see many buddhas.

source: །བསྐལ་པ་སུམ་ཅུ་རྩ་དྲུག་འདོར།
en: “After thirty-six eons they will renounce saṃsāra,

source: །འདུས་བྱས་རྣམས་ཀྱང་རྣམ་པར་བཟློག །སངས་རྒྱས་ཀྱི་ནི་བྱང་ཆུབ་ལས།
en: Reject all compounded things,

source: །ཕྱིར་ཡང་ལྡོག་པར་མི་འགྱུར་རོ།
en: And henceforth make irreversible progress Toward the awakening of a buddha.

source: །ལོང་བ་ཞ་བོར་མི་འགྱུར་ཏེ།
en: “They will not become blind, or crippled,

source: །བླུན་པོར་རྟག་ཏུ་དེ་མི་འགྱུར།
en: Nor will they ever become dumb.

source: །འཇིག་རྟེན་ཀུན་ན་རྣམ་དག་ཅིང་།
en: In all their future worlds they will have complete faculties,

source: །ཤེས་རབ་བསོད་ནམས་ཤིན་ཏུ་འཕེལ།
en: And their wisdom and merit will exponentially increase.

source: །དེ་བཞིན་གཤེགས་ལ་ཕྱག་བྱས་ན།
en: “If they pay homage to the thus-gone ones,

source: །སྡིག་པའི་གྲོགས་པོ་མི་འཕེལ་ཞིང་།
en: Evil companions will not proliferate,

source: །གསོད་དང་ཕྱིར་རྒོལ་དེ་བཞིན་ཏེ།
en: Nor will killers and opponents,

source: །དགེ་བའི་བཤེས་གཉེན་རྙེད་པར་འགྱུར།
en: And they will find a virtuous spiritual friend. “If they pay homage to that buddha

source: །སངས་རྒྱས་དེ་དང་འཇིག་རྟེན་གྱི། །མཆོད་རྟེན་གཞན་ལ་ཕྱག་བྱས་ན།
en: And other objects of veneration in the world,

source: །ཆོས་ཀུན་རྟོགས་པར་རིག་པ་ཡིས།
en: They will gain the knowledge that understands all phenomena

source: །བྱང་ཆུབ་ལ་ནི་ནེམ་ནུར་མེད།
en: And thereby have no hesitations about awakening.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་སྒྲོལ་མ་ཞེས་བྱ་བ་དེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་དག་པ་འབྱུང་བའི་དཔལ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Above, in the world system called Precious Tārā, dwells the thus-gone one, the worthy one, the completely perfect buddha called Glory of the Origin of Pure Jewels.

source: དེའི་མཚན་ཐོས་ན་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རིན་ཆེན་བདུན་ཐོབ་པར་འགྱུར་རོ།
en: Those who hear his name will obtain the seven precious factors of awakening.

source: །བསྐལ་པ་སུམ་ཅུར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: In thirty eons, they will turn away from saṃsāra.”

source: །རིན་ཆེན་སྒྲོལ་མ་འཇིག་རྟེན་ཁམས་མཆོག་ན།
en: “In the supreme world system Precious Tārā,

source: །རིན་ཆེན་འབྱུང་ཞེས་བྱ་བའི་སངས་རྒྱས་ཏེ།
en: Is the buddha called Origin of Jewels.

source: །དེ་ཡི་མཚན་མཆོག་དམ་པ་ཐོས་ནས་ནི།
en: Upon hearing his most excellent name,

source: །སྲོག་ཆགས་རྣམས་ཀྱིས་བྱང་ཆུབ་ཡན་ལག་ཐོབ།
en: Living beings will obtain the factors of awakening.

source: །བསྐལ་པ་སུམ་ཅུ་དག་ནི་འདོར་བར་བྱེད།
en: “In thirty eons, they will renounce saṃsāra

source: བྱང་ཆུབ་ལ་ཡང་ཤིན་ཏུ་ལེགས་པར་གནས། །སྨྲ་བ་དཔའ་བོ་རབ་ཏུ་མི་བསྐྱོད་པ།
en: And be perfectly poised for awakening.

source: །སྐྱེས་བུ་དམ་པ་དག་ཀྱང་མང་དུ་མཐོང་།
en: They will also see many sublime persons Who are preachers of unshakable courage.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་གློག་གི་འོད་ཅེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གློག་གི་སྒྲོན་མ་ཏོག་གི་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Above, in the world system called Flash of Lightning, dwells the thus-gone one, the worthy one, the completely perfect buddha called King of the Tip of the Lamp of Lightning.

source: དེའི་མཚན་ཐོས་ན་མི་ཁོམ་པ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་བར་འགྱུར་རོ།
en: Those who hear his name will avoid all unfortunate rebirths.

source: །དེ་དག་བསྐལ་པ་ཉི་ཤུར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: In twenty eons, they will turn away from saṃsāra.”

source: །གློག་སྣང་ཞེས་བྱའི་ཞིང་དེ་ན།
en: “In the field called Flash of Lightning,

source: །སངས་རྒྱས་རྫུ་འཕྲུལ་ཆེན་པོ་ནི།
en: There is a buddha with great miraculous power

source: །གློག་འོད་ཏོག་གི་རྒྱལ་ཞེས་བྱ།
en: Called King of the Tip of the Flash of Lightning,

source: །པད་མོ་དམ་པ་ལེགས་པར་བྱུང་།
en: Who was excellently born from a sublime lotus.

source: །དེ་ཡི་མཚན་ཡང་ཐོས་ནས་ནི།
en: “Those who hear his name

source: །མི་ཁོམ་ཐམས་ཅད་རྣམ་པར་སྤོང་།
en: Will avoid all unfortunate rebirths.

source: །བསྐལ་པ་ཉི་ཤུར་འདོར་བར་བྱེད།
en: After twenty eons, they will renounce saṃsāra

source: །མྱུར་དུ་བྱང་ཆུབ་འཚང་ཡང་རྒྱ།
en: And, henceforth, swiftly awaken to awakening.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་གསེར་གྱི་ཤིང་ཏ་ལ་རབ་ཏུ་བརྒྱན་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཏ་ལའི་རྒྱལ་པོ་མངོན་པར་འཕགས་པའི་དཔལ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Above, in the world system called Adorned with Golden Palmyra Trees, dwells the thus-gone one, the worthy one, the completely perfect buddha called Glory of the Exalted King of Palmyra Trees.

source: དེའི་མཚན་ཐོས་ན་སེམས་ཅན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པར་འགྱུར་རོ།
en: Those who hear his name will be exalted above all beings.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཏ་ལ་ནམ་མཁའ་ལ་ཉེ་བ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ནམ་མཁའི་སྒྲོན་མ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Above, in the world system called Palmyra Trees Reaching the Sky, dwells the thus-gone one, the worthy one, the completely perfect buddha called Lamp of the Sky of Dharma.

source: དེའི་མཚན་ཐོས་ན་བསྐལ་པ་དྲུག་ཅུར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་པར་འགྲོ་བ་ལས་ཀྱང་ཕྱིར་མི་ལྡོག་གོ།
en: Those who hear his name will, after sixty eons, turn away from saṃsāra and henceforth their progress toward truly going to a buddhafield will be irreversible.

source: །ཚེ་འདི་ལ་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་ཡང་ཐོབ་པར་འགྱུར་རོ།
en: In this lifetime, they will have visions of the thus-gone ones.

source: །ཐ་ན་རྨི་ལམ་ན་ཡང་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཡན་ལག་ལྔས་ཕྱག་འཚལ་ལོ།
en: Even in their dreams, they will prostrate to that thus-gone one, touching the ground with the five parts of their bodies.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་ལྷག་པའི་བསམ་པས་རི་མོ་བྱེད་པར་འགྱུར་རོ། །བལྟ་བར་བྱ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་བླ་ན་མེད་པ་མཁས་པ་དང་ལྡན་པའི་སེམས་ཅན་ཡང་རྙེད་པར་འགྱུར་རོ།
en: They will wholeheartedly revere the blessed buddhas. They also will find beings with unexcelled wisdom to esteem, honor, and serve.

source: །ཚེ་འདི་ལ་ཡོན་ཏན་འདི་དག་ཐོབ་པར་འགྱུར་ཏེ།
en: In this lifetime, they will obtain these qualities.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དེ་ནི་ཡོན་ཏན་དང་ཕན་ཡོན་ཚད་མེད་དོ།
en: For, Śāriputra, those thus-gone ones have immeasurable qualities and virtues.”

source: །ནམ་མཁའ་ཡོངས་སུ་བརྒྱན་པའི་ཞིང་།
en: “In the field Fully-Adorned Sky,

source: །དེ་ན་གྲགས་ཆེན་སངས་རྒྱས་ནི།
en: Is a highly-renowned buddha, Supreme among humans,

source: །ཆོས་ཀྱི་ནམ་མཁའ་སྒྲོན་མའི་མཚན། །སྐྱེས་བུ་དག་ནི་ཁྱུ་མཆོག་སྟེ།
en: Named Lamp of the Sky of Dharma.

source: །བསྐལ་པ་དྲུག་ཅུ་ཕྱིར་བཟློག་ཅིང་།
en: Will, after sixty eons, reject saṃsāra

source: །བླ་མེད་སངས་རྒྱས་ཆོས་རྣམས་དང་། །སངས་རྒྱས་འགྲོ་བའང་ཐོབ་པར་འགྱུར།
en: And obtain the unexcelled qualities of a buddha And the destiny to become awakened.

source: །སངས་རྒྱས་དཔའ་བོ་ཆེན་པོ་དག །ཚེ་འདི་ཉིད་ལ་མཐོང་བར་འགྱུར།
en: “In this very lifetime, they will see The great awakened heroes.

source: །ལྷག་པའི་བསམ་པས་བྱམས་པའི་སེམས།
en: With a wholeheartedly loving mind,

source: །དཀྱིལ་འཁོར་ལྔ་ཡིས་ཕྱག་བྱས་ཏེ།
en: They will prostrate to them, using the five parts of their bodies.

source: །རྨི་ལམ་ན་ཡང་རྫོགས་སངས་རྒྱས།
en: “Even in their dreams, they will see

source: །ཀུན་ཏུ་བཟང་པོ་མཐོང་བར་འགྱུར།
en: The perfect, ideal buddhas.

source: །ཡིད་ཀྱི་རྟོག་པ་གཞན་གྱི་སེམས།
en: Understanding the thoughts in others’ minds,

source: །ཆོས་ཀྱི་རྒྱལ་པོ་དྲན་ནས་སུ།
en: And recollecting the king of Dharma,

source: །ཤེས་ལ་མཁས་པའི་སེམས་ཅན་རྣམས།
en: “They will find beings adept in wisdom

source: །བསྙེན་བཀུར་བྱ་བ་རྙེད་པར་འགྱུར།
en: To serve.

source: །དེ་ནི་ཚེ་འདིའི་ཡོན་ཏན་ཏེ།
en: These will be their qualities in this lifetime,

source: །སྟོན་པ་ཡོན་ཏན་ཚད་མེད་ཅིང་།
en: For the teacher has immeasurable qualities

source: །ཆོས་ཀུན་གྱི་ཡང་ཕ་རོལ་ཕྱིན།
en: And has achieved mastery over all phenomena.

source: །ཕུན་སུམ་ཚོགས་པ་ཀུན་གཉེར་བས།
en: “Those who seek all sublime qualities Should lovingly pay homage!

source: །བྱམས་པའི་སེམས་ཀྱིས་ཕྱག་གྱིས་ཤིག །སྟེང་གི་ཕྱོགས་ན་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་ཏན་ཐམས་ཅད་འབྱུང་བ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Above, in the world system Well Proportioned , dwells the thus-gone one, the worthy one, the completely perfect buddha called Source of All Good Qualities.

source: །ཅིའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་ཞེས་བྱ་ཞེ་ན།
en: Why is that world system called Well Proportioned

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་གཞི་གསེར་ལ་བཻ་དཱུརྱས་མིག་མངས་རིས་སུ་བྲིས་པ། མིག་མངས་རིས་ཐམས་ཅད་ནས་མེ་ཏོག་གི་ཤིང་དང་། རིན་པོ་ཆེའི་ཤིང་དང་། ཙན་དན་ལ་སོགས་པ་སྤོས་ཀྱི་ཤིང་དག་གིས་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་ཞིང་དེ་དག་ལས་དྲི་བྱུང་བས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་གདུགས་གཅིག་ཏུ་ཁྱབ་པར་འགྱུར་རོ།
en: It is well proportioned because that world system has a gold surface outlined in a checked pattern with beryl gems and having fragrant trees such as flower trees, jewel trees, sandalwood trees, and the like in each of its squares. Fragrance wafts from these trees, spreading out in a single canopy that covers all buddhafields.

source: །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཐམས་ཅད་འབྱུང་བ་དེ་ཆོས་ཀྱི་གདན་ལ་བཞུགས་པའི་མཚན་ཐོས་ནས་དབང་པོ་ཐམས་ཅད་རབ་ཏུ་རྣམ་པར་ཕྱེ་བ་ཡོངས་སུ་འཛིན་ཏོ། །སངས་རྒྱས་ཀྱི་ཆོས་རབ་ཏུ་རྣམ་པར་ཕྱེ་བ་ཡང་ཡོངས་སུ་འཛིན་ཏོ།
en: Those who hear the name of thus-gone one Source of All Good Qualities, as he sits on his Dharma seat, will obtain the well-proportioned qualities of a buddha.

source: །བསྐལ་པ་བརྒྱད་ཅུར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པར་ཡང་བྱས་པར་འགྱུར་རོ།
en: In eighty eons they will turn away from saṃsāra.”

source: །འཇིག་རྟེན་ཁམས་ནི་བླ་མེད་པ།
en: “The unexcelled world system

source: །ཤིན་ཏུ་རྣམ་པར་ཕྱེ་ཞེས་བྱ། །ཤིང་གིས་མིག་མངས་རིས་སུ་བྱས།
en: Called Well Proportioned

source: །སྤོས་ཀྱི་ཤིང་གིས་ཤིན་ཏུ་མཛེས།
en: Is decorated with fragrant trees That form a checkered pattern.

source: །དེ་དག་ལས་ནི་དྲི་བྱུང་བས།
en: “A fragrance wafts from them

source: །ས་ཀུན་ཏུ་ཡང་རྒྱས་པར་འགྱུར། །གདུགས་གཅིག་ཏུ་ནི་བྱས་ནས་སུ།
en: That spreads over all lands.

source: །བར་སྣང་ལ་ཡང་དེ་གནས་སོ།
en: It lingers in the air, Forming a single canopy.

source: །དེ་ལ་སངས་རྒྱས་བཞུགས་པ་ནི།
en: “There dwells a buddha,

source: །ཡོན་ཏན་ཡན་ལག་ཐམས་ཅད་འབྱུང་།
en: Source of All Good Qualities—

source: །མིང་མཚན་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས།
en: His name is extremely sublime,

source: །ཆོས་ཀྱི་རྒྱལ་པོ་འཇིགས་མེད་དེ།
en: That fearless Dharma king.

source: །ཡན་ལག་ཐམས་ཅད་མཛེས་པར་འགྱུར།
en: Will have exquisite bodily limbs,

source: །བྱད་བཞིན་བཟང་ཞིང་བལྟ་ན་སྡུག །གཟུགས་མཛེས་མཐོང་ན་དགའ་བ་དང་། །ཤིན་ཏུ་ཕྱེ་བའི་ལུས་སུ་འགྱུར།
en: Beautiful, captivating faces, Exquisite forms pleasing to behold, “And well-proportioned bodies

source: །ཆུ་ཞེང་གབ་པ་ནྱ་གྲོ་བཞིན།
en: With a circumference like that of a banyan tree.

source: །དཔལ་གྱིས་ཤིན་ཏུ་འབར་གྱུར་ཅིང་།
en: Blazing with glory,

source: །སངས་རྒྱས་དག་གི་ཞིང་དུ་འགྲོ།
en: They will travel to the fields of the buddhas.

source: །བསྐལ་པ་བརྒྱད་ཅུར་འདོར་བར་བྱེད།
en: After eighty eons they will renounce saṃsāra,

source: །འདུས་བྱས་རྣམས་ཀྱང་རྣམ་པར་ཟློག །སངས་རྒྱས་ཆོས་རྣམས་ཕྱེ་བ་ཡང་།
en: Reject all conditioned things,

source: །རྣམ་པ་ཐམས་ཅད་མྱུར་དུ་འཐོབ།
en: And then swiftly attain

source: །ཡོན་ཏན་ཡན་ལག་ཀུན་འབྱུང་བ།
en: The well-proportioned qualities of a buddha, in all their aspects.

source: །སངས་རྒྱས་རྗེས་སུ་དྲན་བྱས་ན།
en: “Upon recollecting the buddha

source: །ཡོན་ཏན་ཕན་ཡོན་དག་པ་ནི།
en: Source of All Attributes of Good Qualities, Their qualities and virtues will be pristine,

source: །སངས་རྒྱས་ཆོས་ཀྱི་གོ་འཕང་གནས།
en: Thus poising them for the state of a buddha’s qualities.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་བཟང་པོའི་མཆོག་ཅེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་བཟང་པོའི་ཏོག་གི་རྒྱལ་མཚན་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Above, in the world system called Supreme Goodness, dwells the thus-gone one called King Victory Banner at the Pinnacle of Goodness.

source: དེའི་མཚན་ཐོས་ན་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: Those who hear his name will not regress from the qualities of a buddha.

source: །དེ་དག་གིས་བསྐལ་པ་ལྔ་བཅུར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: They will turn away from saṃsāra in fifty eons.”

source: །འཇིག་རྟེན་ཁམས་ནི་བཟང་མཆོག་སྟེ།
en: “In the world system Supreme Goodness,

source: །བཟང་པོ་དགའ་བ་ཞེས་ཀྱང་བྱ།
en: Also called Delight in Goodness,

source: །དེ་ན་རྫོགས་པའི་སངས་རྒྱས་ནི།
en: Dwells a perfect buddha,

source: །བཟང་ཏོག་རྒྱལ་མཚན་དྲང་སྲོང་སྟེ།
en: The sage Victory Banner at the Pinnacle of Goodness.

source: །རྒྱལ་མཆོག་ཆོས་ཀྱི་རྒྱལ་པོ་ཡིན།
en: “He is a supreme victor, a king of Dharma,

source: །མཚན་མཆོག་སུམ་ཅུ་རྩ་གཉིས་ལྡན།
en: Who possesses thirty-two supreme names.

source: །སངས་རྒྱས་ཆོས་རྣམས་མི་འབྲི་ཞིང་།
en: The qualities of a buddha will never wane.

source: །བསྐལ་པ་དག་ནི་ལྔ་བཅུར་ཡང་།
en: “After fifty eons,

source: །འཁོར་བ་དག་ནི་རྣམ་པར་སྤོང་།
en: They will renounce saṃsāra

source: །འཇིག་རྟེན་དུ་ཡང་མྱུར་བར་ནི། །གྲགས་ཆེན་ལྷ་ཡི་ལྷར་འགྱུར་རོ།
en: And swiftly become gods among gods Highly renowned throughout the world.

source: །སྟེང་གི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེའི་རིགས་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་གཟུགས་འཛིན་པ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: “Above, in the world system called Family of Jewels, dwells the thus-gone one called He Who Possesses a Body Adorned with All Jewels.

source: །ཅིའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་རིན་པོ་ཆེའི་རིགས་ཞེས་བྱ་ཞེ་ན།
en: Why is that world system called Family of Jewels?
